{
  "projectName": "Data Visualization is Art: Turn Data Into Beautiful Insights with Autodash",
  "heroImage": "img_b504db9243.png",
  "scenes": [
    {
      "id": 29,
      "order": 1,
      "title": "Hero Opening",
      "narration": "",
      "visualDescription": "Full-screen hero banner image fade-in showing the Autodash logo and artistic data visualization concept. Smooth fade-in effect with subtle zoom.",
      "durationSeconds": 3.0,
      "voiceoverFile": null,
      "images": [
        "img_b504db9243.png"
      ]
    },
    {
      "id": 30,
      "order": 2,
      "title": "The Data Artist Vision",
      "narration": "After testing Autodash, our AI data apps platform, we discovered something fascinating. Users don't just want standard dashboards. They want to personalize the experience deeply, treating data visualization as a form of art. We listened, and built features to help them become true data artists, turning insights into visually stunning, highly customized creations.",
      "visualDescription": "Split screen transition: Left side shows boring standard dashboard (gray, plain), right side shows vibrant artistic data visualization with custom colors and gradients. Text overlay: 'From Standard → To Artistic'. Animate the transformation from left to right.",
      "durationSeconds": 24.7,
      "voiceoverFile": "audio_scene_2.mp3",
      "images": [
        "img_b504db9243.png"
      ]
    },
    {
      "id": 31,
      "order": 3,
      "title": "Feature 1: Direct Color Customization",
      "narration": "First major feature: users can now change trace, line, bar, and component colors directly, without asking AI to regenerate the chart. No more wasted time or credits. The system auto-detects components in your visualization and lets you edit them on the fly.",
      "visualDescription": "Show before/after comparison: Display a chart with green lines, then demonstrate the color picker interface changing the green to a different shade with lower opacity. Animate the color transition smoothly. Text callout: 'Auto-detects components • Direct editing • No regeneration needed'",
      "durationSeconds": 19.0,
      "voiceoverFile": "audio_scene_3.mp3",
      "images": [
        "img_b504db9243.png"
      ]
    },
    {
      "id": 32,
      "order": 4,
      "title": "Feature 2: Background and Opacity Control",
      "narration": "Second feature: complete control over chart backgrounds, KPI cards, and text backgrounds with opacity adjustment. Watch this transformation: a white background becomes black, and black text becomes white, all without regeneration. This same functionality applies to KPI cards and all visualization components.",
      "visualDescription": "Dramatic before/after split screen: Show the exact transformation described - white chart background switching to black, black lines/text switching to white. Animate the color inversion effect smoothly. Include a KPI card example also transforming. Text overlay: 'Background + Opacity Control • Charts • KPI Cards • Text Elements'",
      "durationSeconds": 21.5,
      "voiceoverFile": "audio_scene_4.mp3",
      "images": [
        "img_b504db9243.png"
      ]
    },
    {
      "id": 33,
      "order": 5,
      "title": "Feature 3: Dashboard-Wide Gradients",
      "narration": "Third feature: apply colors to your entire dashboard, adjust opacity, and create stunning two-color gradients. Transform your entire workspace from standard white to custom colors or beautiful white-gray gradients that give your data a professional, artistic feel.",
      "visualDescription": "Show the color edit panel interface, then demonstrate full dashboard transformation: Start with plain dashboard, apply solid color change, then show the white-gray gradient being applied across the entire dashboard. Animated gradient flow effect. Text: 'Whole Dashboard Control • Solid Colors • 2-Color Gradients'",
      "durationSeconds": 19.0,
      "voiceoverFile": "audio_scene_5.mp3",
      "images": [
        "img_b504db9243.png"
      ]
    },
    {
      "id": 34,
      "order": 6,
      "title": "Powered by AI Analytics",
      "narration": "All of this artistic control is combined with powerful AI data analytics that get you answers fast, using Python's data science libraries to find insights in your data.",
      "visualDescription": "Show animated flow diagram: Data Input → AI Processing (Python libraries icon) → Beautiful Visualizations. Include floating icons of pandas, matplotlib, plotly libraries. Text overlay: 'AI-Powered • Python Data Science • Fast Insights'",
      "durationSeconds": 11.9,
      "voiceoverFile": "audio_scene_6.mp3",
      "images": [
        "img_b504db9243.png"
      ]
    },
    {
      "id": 35,
      "order": 7,
      "title": "What's Coming Next",
      "narration": "We're not stopping here. Coming soon: Preference Memory that learns your color and aesthetic preferences automatically. Professional themes for instant inspiration. Complete font and gridline editing. A dedicated Analytics Mode like Jupyter notebooks. And comprehensive data connectors beyond Excel and CSV.",
      "visualDescription": "Animated bullet list with icons appearing one by one: 1) 🧠 Preference Memory - learns your style, 2) 🎨 Professional Themes - instant inspiration, 3) ✏️ Font & Gridline Editing, 4) 📊 Analytics Mode - Jupyter-like interface, 5) 🔌 Data Connectors - SQL, databases & more. Each item fades in with a subtle pop animation.",
      "durationSeconds": 20.9,
      "voiceoverFile": "audio_scene_7.mp3",
      "images": [
        "img_b504db9243.png"
      ]
    },
    {
      "id": 36,
      "order": 8,
      "title": "Become a Data Artist",
      "narration": "Autodash is the perfect tool for analytics done beautifully. Data visualization is an art form, and we've built the product that turns you into the data artist. Try it at autodash.art.",
      "visualDescription": "Montage of beautiful dashboard examples with artistic color schemes and gradients cycling through. End with big text callout: 'autodash.art' with 'Become a Data Artist' subtitle. Fade to logo.",
      "durationSeconds": 12.7,
      "voiceoverFile": "audio_scene_8.mp3",
      "images": [
        "img_b504db9243.png"
      ]
    }
  ]
}