{
  "projectName": "Data Visualization as Art: Introducing Autodash's Creative Design Features",
  "heroImage": "img_b504db9243.png",
  "scenes": [
    {
      "id": 20,
      "order": 1,
      "title": "Hero Opening",
      "narration": "",
      "visualDescription": "Full-screen fade-in of the Autodash hero image with the text 'Data Visualization is art. Create like a data artist' displayed prominently. Clean, artistic presentation that sets the tone for creativity and innovation.",
      "durationSeconds": 3.0,
      "voiceoverFile": null,
      "images": [
        "img_b504db9243.png"
      ]
    },
    {
      "id": 21,
      "order": 2,
      "title": "Introduction: Data Visualization as Art",
      "narration": "What if data visualization wasn't just about charts and numbers, but about creating art? At Autodash, we discovered something fascinating: our users don't want standard dashboards. They want to personalize their data experience deeply, treating visualization as a true art form.",
      "visualDescription": "Dynamic text overlay with subtle animations. Show the Autodash logo and tagline 'Turn data into insight, beautifully'. Modern, clean aesthetic with data-inspired visual elements flowing in the background.",
      "durationSeconds": 21.8,
      "voiceoverFile": "audio_scene_2.mp3",
      "images": [
        "img_b504db9243.png"
      ]
    },
    {
      "id": 22,
      "order": 3,
      "title": "The Discovery: What Users Really Want",
      "narration": "After extensive testing of Autodash, our AI-powered data visualization tool, we listened to what users were telling us. They didn't just want functional dashboards. They wanted to become data artists, creating visually stunning, highly customized creations that transform insights into art.",
      "visualDescription": "Show user feedback concepts and transition to excited user personas. Visual metaphor of transformation from basic charts to artistic visualizations. Use icons and graphics representing customization and creativity.",
      "durationSeconds": 21.0,
      "voiceoverFile": "audio_scene_3.mp3",
      "images": [
        "img_b504db9243.png"
      ]
    },
    {
      "id": 23,
      "order": 4,
      "title": "Design Feature: Instant Color Customization",
      "narration": "We've introduced powerful new design features. First up: direct color control. Now you can change trace, line, bar, and component colors instantly—no regeneration needed, no credits consumed. Simply select your element and pick your perfect shade. It's like having a color palette at your fingertips.",
      "visualDescription": "Screen recording style animation showing the color picker interface. Demonstrate changing a chart from one color scheme to another with smooth transitions. Show the before and after: green shades transforming with adjusted opacity.",
      "durationSeconds": 22.6,
      "voiceoverFile": "audio_scene_4.mp3",
      "images": [
        "img_b504db9243.png"
      ]
    },
    {
      "id": 24,
      "order": 5,
      "title": "Design Feature: Background and Opacity Controls",
      "narration": "Want to change your chart's entire mood? You can now modify chart backgrounds, KPI card backgrounds, and text backgrounds—all with adjustable opacity. Watch as we transform a white background to black, and flip text from black to white. The system auto-detects all components, making styling effortless.",
      "visualDescription": "Animated demonstration of background color changes. Show the dramatic transformation from light theme to dark theme. Highlight KPI cards changing alongside charts. Emphasize the smooth, real-time nature of the changes.",
      "durationSeconds": 24.5,
      "voiceoverFile": "audio_scene_5.mp3",
      "images": [
        "img_b504db9243.png"
      ]
    },
    {
      "id": 25,
      "order": 6,
      "title": "Design Feature: Dashboard-Wide Styling",
      "narration": "Take it even further with dashboard-wide customization. Select a single color for your entire dashboard, adjust global opacity, or apply stunning two-color gradients. Transform your data canvas from plain white to an elegant white-gray gradient, creating a cohesive, professional look that's uniquely yours.",
      "visualDescription": "Show the color edit panel interface. Demonstrate gradient application across an entire dashboard. Display multiple gradient examples: subtle and bold. Emphasize the artistic, cohesive result of dashboard-wide styling.",
      "durationSeconds": 23.7,
      "voiceoverFile": "audio_scene_6.mp3",
      "images": [
        "img_b504db9243.png"
      ]
    },
    {
      "id": 26,
      "order": 7,
      "title": "Powered by AI Analytics",
      "narration": "But Autodash isn't just about beautiful visuals. Behind the scenes, powerful AI data analytics work for you. Get answers fast using Python's advanced data science libraries. Ask questions, and watch as sophisticated analytics combine with stunning design to deliver insights you can actually use.",
      "visualDescription": "Split screen showing both beautiful visualizations and analytics queries. Display code-like elements transforming into charts. Show the query interface with example analytics questions being answered in real-time.",
      "durationSeconds": 23.4,
      "voiceoverFile": "audio_scene_7.mp3",
      "images": [
        "img_b504db9243.png"
      ]
    },
    {
      "id": 27,
      "order": 8,
      "title": "Coming Soon: Even More Power",
      "narration": "We're not stopping here. Coming soon: custom fonts and gridline controls, professionally designed themes for instant inspiration, and intelligent preference memory that learns your aesthetic choices. Plus, comprehensive data connectors and a dedicated analytics mode for building powerful data pipelines.",
      "visualDescription": "Animated roadmap or feature preview. Show mockups or concept designs of upcoming features. Use forward-looking, exciting visuals. Display icons for: fonts, themes, memory/AI, connectors, and analytics mode.",
      "durationSeconds": 22.0,
      "voiceoverFile": "audio_scene_8.mp3",
      "images": [
        "img_b504db9243.png"
      ]
    },
    {
      "id": 28,
      "order": 9,
      "title": "Call to Action: Become a Data Artist",
      "narration": "Ready to become a data artist? Autodash transforms raw data into beautiful, interactive visualizations. No code. No complexity. Just your data, your vision, and the tools to bring it to life. Visit autodash.art and start creating today. Because analytics should be done beautifully.",
      "visualDescription": "Return to hero image or show final polished dashboard examples. Display the Autodash logo and URL clearly: autodash.art. Use inspiring, uplifting visuals. End with a clean call-to-action screen.",
      "durationSeconds": 23.5,
      "voiceoverFile": "audio_scene_9.mp3",
      "images": [
        "img_b504db9243.png"
      ]
    }
  ]
}