{
  "projectName": "Autodash: Transform Data into Art with Powerful Design Controls",
  "heroImage": "img_b504db9243.png",
  "scenes": [
    {
      "id": 7,
      "order": 1,
      "title": "Hero Opening",
      "narration": "",
      "visualDescription": "Full-screen fade-in of the Autodash interface hero image showing the data visualization platform with colorful charts and controls",
      "durationSeconds": 3.0,
      "voiceoverFile": null,
      "images": [
        "img_b504db9243.png"
      ]
    },
    {
      "id": 8,
      "order": 2,
      "title": "The Discovery",
      "narration": "After testing our product Autodash, an AI Data Apps platform, we discovered something fascinating. Most users aren't just looking for standard dashboards. They want to personalize the experience deeply, treating data visualization as a form of art.",
      "visualDescription": "Split screen showing: LEFT - traditional boring dashboard with standard colors, RIGHT - vibrant artistic data visualization with custom colors and styling. Animated transition emphasizing the artistic approach",
      "durationSeconds": 16.9,
      "voiceoverFile": "audio_scene_2.mp3",
      "images": []
    },
    {
      "id": 9,
      "order": 3,
      "title": "Becoming Data Artists",
      "narration": "Listening to their interests, we've added features designed to help users become true data artists, turning insights into visually stunning, highly customized creations. Let's walk through all the design features we introduced.",
      "visualDescription": "Animated text callout: 'Data Visualization = Art' with paint brush icon. Show URL prominently: autodash.art. Transition to feature showcase preview with icons representing: color control, component detection, background customization",
      "durationSeconds": 14.9,
      "voiceoverFile": "audio_scene_3.mp3",
      "images": []
    },
    {
      "id": 10,
      "order": 4,
      "title": "Feature 1: Direct Color Control",
      "narration": "First major feature: Now users can change trace, line, bar, and component colors directly, instead of asking the system to regenerate the chart with a different color. This saves time and gives you instant control.",
      "visualDescription": "Show before/after comparison: TOP - Chart with standard green line, BOTTOM - Same chart with modified green shade and lower opacity. Add animated UI element showing color picker interface with opacity slider. Highlight: 'No Regeneration Required' badge",
      "durationSeconds": 14.5,
      "voiceoverFile": "audio_scene_4.mp3",
      "images": []
    },
    {
      "id": 11,
      "order": 5,
      "title": "Feature 2: Auto-Component Detection",
      "narration": "The system now auto-detects components generated in your visualization. This intelligent detection allows you to customize each element individually, whether it's a chart, KPI card, or text component.",
      "visualDescription": "Animated diagram showing component detection in action: Show visualization with glowing outlines appearing around different components (charts, KPI cards, text boxes). Label each with: 'Chart Component', 'KPI Card', 'Text Element'. Add scanning animation effect to emphasize auto-detection",
      "durationSeconds": 14.2,
      "voiceoverFile": "audio_scene_5.mp3",
      "images": []
    },
    {
      "id": 12,
      "order": 6,
      "title": "Feature 3: Background & Opacity Customization",
      "narration": "Users can now change the chart, KPI card, and text background along with opacity, without regeneration or consuming credits. Watch this transformation: white background becomes black, and black text and lines become white, creating a stunning inverted theme.",
      "visualDescription": "Dramatic before/after split screen with animated transition: LEFT labeled 'Before' - White background chart with black text/lines, RIGHT labeled 'After' - Black background chart with white text/lines. Show opacity slider animation. Display badge: 'Zero Credits Used'",
      "durationSeconds": 18.7,
      "voiceoverFile": "audio_scene_6.mp3",
      "images": []
    },
    {
      "id": 13,
      "order": 7,
      "title": "Call to Action",
      "narration": "Data visualization is an art form, and we've built a product that turns you into the data artist. Start creating your masterpiece today at autodash dot art.",
      "visualDescription": "Animated finale: Multiple example visualizations cycling through with artistic effects (color shifts, transitions). Large prominent text: 'Try it here: autodash.art' with pulsing animation. End with paint palette icon transforming into data chart",
      "durationSeconds": 10.9,
      "voiceoverFile": "audio_scene_7.mp3",
      "images": []
    }
  ]
}